#include <stdio.h>

int main() {
    int start, end;

    // Запит користувача для введення початку та кінця діапазону
    printf("Введіть початок діапазону: ");
    scanf("%d", &start);

    printf("Введіть кінець діапазону: ");
    scanf("%d", &end);

    // Знаходження останнього числа, що ділиться на 7 без залишку
    int lastMultipleOf7 = end - (end % 7);

    // Виведення результату
    printf("Останнє число в діапазоні, що ділиться на 7 без залишку: %d\n", lastMultipleOf7);

    return 0;
}
